import type { TeamPageProps } from "./Team.page.ts";

export const TeamPageDataTest: TeamPageProps = {
  page: {
    header: {
      super: {
        left: "Команда",
        right: "Количество игроков",
      },
      main: { left: "«Аксу»", right: "29" },
    },
    footer: {
      main: {
        left: "Противодействие продвижению атаки",
        right: "Cоздано на ffm.kz",
      },
      sub: {
        left: "31 авг 2024 09:00—10:00",
        right: "1/1",
      },
    },
  },
  players: [
    {
      title: "Вратари",
      names: [
        "Ефременко Даниил",
        "Кабдыркен Жанибек",
        "Соляник Ярослав",
        "Филимонов Ростислав",
        "Жанат Ислам",
      ],
    },
    {
      title: "Вратари",
      names: [
        "Ефременко Даниил",
        "Кабдыркен Жанибек",
        "Соляник Ярослав",
        "Филимонов Ростислав",
        "Жанат Ислам",
      ],
    },
    {
      title: "Вратари",
      names: [
        "Ефременко Даниил",
        "Кабдыркен Жанибек",
        "Соляник Ярослав",
        "Филимонов Ростислав",
        "Жанат Ислам",
      ],
    },
    {
      title: "Вратари",
      names: [
        "Ефременко Даниил",
        "Кабдыркен Жанибек",
        "Соляник Ярослав",
        "Филимонов Ростислав",
        "Жанат Ислам",
      ],
    },
    {
      title: "Вратари",
      names: [
        "Ефременко Даниил",
        "Кабдыркен Жанибек",
        "Соляник Ярослав",
        "Филимонов Ростислав",
        "Жанат Ислам",
      ],
    },
    {
      title: "Вратари",
      names: [
        "Ефременко Даниил",
        "Кабдыркен Жанибек",
        "Соляник Ярослав",
        "Филимонов Ростислав",
        "Жанат Ислам",
      ],
    },
    {
      title: "Вратари",
      names: [
        "Ефременко Даниил",
        "Кабдыркен Жанибек",
        "Соляник Ярослав",
        "Филимонов Ростислав",
        "Жанат Ислам",
      ],
    },
    {
      title: "Вратари",
      names: [
        "Ефременко Даниил",
        "Кабдыркен Жанибек",
        "Соляник Ярослав",
        "Филимонов Ростислав",
        "Жанат Ислам",
      ],
    },
    {
      title: "Вратари",
      names: [
        "Ефременко Даниил",
        "Кабдыркен Жанибек",
        "Соляник Ярослав",
        "Филимонов Ростислав",
        "Жанат Ислам",
      ],
    },
  ],
};
