import { ExercisesPageProps } from "./Exerises.page";

export const ExercisesPageDataTest: ExercisesPageProps = {
  page: {
    superHeader: {
      main: {
        left: "Противодействие продвижению атаки",
        right: "Cоздано на ffm.kz",
      },
      sub: {
        left: "31 авг 2024 09:00—10:00",
      },
    },
  },
  exercises: [
    {
      header: "Технический маршрут с мячом",
      headerLeft: "Упр. 1",
      imageSrc:
        "https://mayvers.com.au/wp-content/uploads/2017/09/test-image.jpg",
      leftPieces: [
        {
          icon: "goal",
          header: "вид упражнения",
          text: "Разминочная форма",
        },
        {
          header: "Размеры и формат поля",
          text: "50х40",
        },
        {
          header: "Акценты",
          text: "Качество движений: согласованность работы рук и ног, вынос бедра, стабилизация корпуса. Режим работы — аэробная нагрузка, средний темп.",
        },
        {
          header: "цель упражнения",
          text: "Активное движение в среднем и высоком темпе, выполнение движений по маршруту.",
        },
        {
          header: "Общая продолжительность",
          text: "20 мин.",
        },
        {
          header: "Количество серий",
          text: "1",
        },
        {
          header: "Количество",
          text: "1",
        },
        {
          header: "продолжительность повторения",
          text: "3 мин.",
        },
        {
          header: "повторений в серии",
          text: "4",
        },
        {
          header: "пауза между повторениями",
          text: "3 мин.",
        },
      ],
      rightPieces: [
        {
          header: "описание упражнения",
          text: "Экстенсивная разминка. Технический маршрут с мячом. Беговая координация — ускорения с изменением направления.",
        },
        {
          header: "инвентарь",
          text: "Барьеры, Конусы, Лестницы, Мячи, Стойки",
        },
      ],
    },
    {
      header: "Противодействие продвижению атаки. Позиционное упражнение",
      headerLeft: "Упр. 2",
      imageSrc:
        "https://mayvers.com.au/wp-content/uploads/2017/09/test-image.jpg",
      leftPieces: [
        {
          icon: "case",
          header: "вид упражнения",
          text: "Обучающая форма",
        },
        {
          header: "Размеры и формат поля",
          text: "70х60",
        },
        {
          header: "разделение на команды",
          text: "6х10",
        },
        {
          header: "участников в группе",
          text: "16",
        },
        {
          header: "акценты",
          text: "ЦГ: ограничение пространства и времени, направление атаки соперника, перекрытие линий передач, сохранение дистанции между игроками.  НЦГ: формирование линий передач, контроль и циркуляция мяча.",
        },
        {
          header: "цель упражнения",
          text: "Задача ЦГ: с помощью перемещений противодействовать продвижению и развитию атаки. Задача НЦГ: продвижение и развитие атаки (контроль мяча).",
        },
        {
          header: "Общая продолжительность",
          text: "12 мин.",
        },
        {
          header: "Количество серий",
          text: "1",
        },
        {
          header: "продолжительность повторения",
          text: "2 мин.",
        },
        {
          header: "повторений в серии",
          text: "4",
        },
        {
          header: "пауза между повторениями",
          text: "1 мин.",
        },
      ],
      rightPieces: [
        {
          header: "описание упражнения",
          text: "Экстенсивная разминка. Технический маршрут с мячом. Беговая координация — ускорения с изменением направления.",
        },
        {
          header: "инвентарь",
          text: "Маленькие ворота, Манишки, Мячи, Фишки",
        },
      ],
    },
    {
      header: "Противодействие продвижению атаки. Позиционное упражнение",
      headerLeft: "Упр. 2",
      imageSrc:
        "https://mayvers.com.au/wp-content/uploads/2017/09/test-image.jpg",
      leftPieces: [
        {
          icon: "ball",
          header: "вид упражнения",
          text: "Обучающая форма",
        },
        {
          header: "Размеры и формат поля",
          text: "70х60",
        },
        {
          header: "разделение на команды",
          text: "6х10",
        },
        {
          header: "участников в группе",
          text: "16",
        },
        {
          header: "акценты",
          text: "ЦГ: ограничение пространства и времени, направление атаки соперника, перекрытие линий передач, сохранение дистанции между игроками.  НЦГ: формирование линий передач, контроль и циркуляция мяча.",
        },
        {
          header: "цель упражнения",
          text: "Задача ЦГ: с помощью перемещений противодействовать продвижению и развитию атаки. Задача НЦГ: продвижение и развитие атаки (контроль мяча).",
        },
        {
          header: "Общая продолжительность",
          text: "12 мин.",
        },
        {
          header: "Количество серий",
          text: "1",
        },
        {
          header: "продолжительность повторения",
          text: "2 мин.",
        },
        {
          header: "повторений в серии",
          text: "4",
        },
        {
          header: "пауза между повторениями",
          text: "1 мин.",
        },
      ],
      rightPieces: [
        {
          header: "описание упражнения",
          text: "Экстенсивная разминка. Технический маршрут с мячом. Беговая координация — ускорения с изменением направления.",
        },
        {
          header: "инвентарь",
          text: "Маленькие ворота, Манишки, Мячи, Фишки",
        },
      ],
    },
    {
      header: "Противодействие продвижению атаки. Позиционное упражнение",
      headerLeft: "Упр. 2",
      imageSrc:
        "https://mayvers.com.au/wp-content/uploads/2017/09/test-image.jpg",
      leftPieces: [
        {
          icon: "goal",
          header: "вид упражнения",
          text: "Обучающая форма",
        },
        {
          header: "Размеры и формат поля",
          text: "70х60",
        },
        {
          header: "разделение на команды",
          text: "6х10",
        },
        {
          header: "участников в группе",
          text: "16",
        },
        {
          header: "акценты",
          text: "ЦГ: ограничение пространства и времени, направление атаки соперника, перекрытие линий передач, сохранение дистанции между игроками.  НЦГ: формирование линий передач, контроль и циркуляция мяча.",
        },
        {
          header: "цель упражнения",
          text: "Задача ЦГ: с помощью перемещений противодействовать продвижению и развитию атаки. Задача НЦГ: продвижение и развитие атаки (контроль мяча).",
        },
        {
          header: "Общая продолжительность",
          text: "12 мин.",
        },
        {
          header: "Количество серий",
          text: "1",
        },
        {
          header: "продолжительность повторения",
          text: "2 мин.",
        },
        {
          header: "повторений в серии",
          text: "4",
        },
        {
          header: "пауза между повторениями",
          text: "1 мин.",
        },
      ],
      rightPieces: [
        {
          header: "описание упражнения",
          text: "Экстенсивная разминка. Технический маршрут с мячом. Беговая координация — ускорения с изменением направления.",
        },
        {
          header: "инвентарь",
          text: "Маленькие ворота, Манишки, Мячи, Фишки",
        },
      ],
    },
  ],
};
